# Taps
tap "homebrew/cask-fonts"

# Core tools
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "zoxide"

# Zsh plugins
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts (for agnoster theme + eza icons)
cask "font-hack-nerd-font"
cask "font-ubuntu-nerd-font"
